{
    "1": {
        "title": "Introduction to Statistics and Calculus Concepts",
        "content": "In this level, we begin by covering key concepts in statistics and calculus that are essential for understanding more advanced topics in machine learning. We start with Maximum Likelihood Estimation (MLE), a technique used to estimate the parameters of a probability distribution by maximizing the likelihood of the observed data. For example, in the case of a Gaussian Distribution, MLE allows us to estimate the parameters μ (mean) and σ² (variance) by maximizing the likelihood function. Next, we dive into the Central Limit Theorem (CLT), which states that the sample mean of a large enough sample from any distribution will approximate a normal distribution. This result allows us to apply normal distribution approximations to real-world problems. Additionally, we discuss the Bias-Variance Tradeoff, which is a key concept in model generalization. Bias refers to errors from overly simple models (leading to underfitting), while variance refers to errors from overly complex models (leading to overfitting). Lastly, we introduce the concept of derivatives, which is fundamental in calculus, describing how functions change with respect to variables. The derivative provides insights into the slope of a function at a point, helping us understand the rate of change of functions."
    },
    "2": {
        "title": "Differentiation and Its Rules",
        "content": "In this level, we explore the concept of differentiation in more detail, focusing on the rules and techniques used for finding derivatives of functions. The derivative of a function measures its rate of change, which is important for optimization problems in machine learning algorithms. The Power Rule allows us to differentiate functions of the form f(x) = x^n, where the derivative is f'(x) = n * x^(n-1). The Sum Rule is useful when differentiating the sum of two functions, with the derivative being the sum of the individual derivatives: if f(x) = g(x) + h(x), then f'(x) = g'(x) + h'(x). The Product Rule applies when differentiating the product of two functions, and is given by f'(x) = g'(x) * h(x) + g(x) * h'(x). The Quotient Rule is used when differentiating a function that is a quotient of two functions, with the formula f'(x) = (g'(x) * h(x) - g(x) * h'(x)) / h(x)^2. Lastly, the Chain Rule is critical when dealing with composite functions. If f(x) = g(h(x)), the Chain Rule gives f'(x) = g'(h(x)) * h'(x), allowing us to differentiate more complex compositions of functions. We also briefly introduce implicit differentiation, which is used when we can't express one variable explicitly in terms of another, and it involves differentiating both sides of an equation while treating the dependent variable as an implicit function of the independent variable."
    },
    "9": {
        "title": "Introduction to Support Vector Machines and Objective Function",
        "content": "In the context of Support Vector Machines (SVM), the goal is to maximize the margin between the classes. This margin is defined as the distance between the decision boundary (hyperplane) and the closest data points from either class, called support vectors. To maximize the margin, we aim to minimize ∥w∥, where w is the weight vector that defines the hyperplane. A larger margin generally leads to better generalization, as it reduces the model's tendency to overfit to the training data. Maximizing the margin can also be seen as minimizing ∥w∥, as a larger margin corresponds to a smaller ∥w∥. The equation for the margin is 2 / ∥w∥, and minimizing ∥w∥ is mathematically simpler and more effective in preventing overfitting."
    },
    "10": {
        "title": "Why Minimize 1/2 ∥w∥²?",
        "content": "We aim to maximize the margin, which is equivalent to minimizing ∥w∥. However, instead of minimizing ∥w∥ directly, we minimize 1/2 ∥w∥². This is done for several practical reasons: first, squaring ∥w∥ eliminates the absolute value, making the optimization process simpler. Second, the function 1/2 ∥w∥² is quadratic, which makes it a convex function and easier to optimize compared to other forms. Finally, minimizing 1/2 ∥w∥² is consistent with the Lagrangian formulation, which leads to simpler derivatives and more straightforward optimization."
    },
    "11": {
        "title": "Introduction to Support Vector Machines (SVM)",
        "content": "Support Vector Machines (SVM) are powerful supervised learning algorithms used for classification and regression tasks. They work by finding the optimal hyperplane that best separates the data into different classes. The key concept behind SVM is maximizing the margin between the classes. When data lies on quadratic curves, the SVM can be enhanced using a polynomial kernel of degree 2 (d=2), which helps in transforming the input space to make it linearly separable in a higher-dimensional space. For cases where a cubic decision boundary is needed, you can set the kernel degree to 3 (d=3), allowing SVM to separate the data more effectively in the higher-dimensional feature space."
    },
    "12": {
        "title": "Implementing SVM using Scikit-Learn",
        "content": "To implement SVM in Python, we use the Scikit-Learn library. First, we load the dataset, such as the Iris dataset, and split it into training and testing sets using train_test_split. Data preprocessing is essential, and we apply StandardScaler to normalize the data for better performance. The SVC class from Scikit-Learn is used to create the Support Vector Classifier with a specified kernel ('linear' for linear SVM), and C is set to 1.0, which controls the regularization. After training the model with the training data, we predict on the test data and evaluate the model’s performance using accuracy_score and classification_report functions. The final results include the model’s accuracy and detailed performance metrics like precision, recall, and F1-score."
    },
    "13": {
        "title": "Introduction to XGBoost Optimization and Regularization",
        "content": "XGBoost is a powerful gradient boosting framework used for both regression and classification problems. It enhances traditional boosting methods like AdaBoost by incorporating a more efficient optimization technique using second-order derivatives. To optimize the model, XGBoost uses a Taylor expansion to approximate the loss function, which is typically the Mean Squared Error (MSE) in regression problems. This Taylor expansion includes both the gradient (first derivative) and the Hessian (second derivative) of the loss function. By utilizing these derivatives, XGBoost accelerates the optimization process and improves its accuracy. Additionally, the method uses Newton’s optimization method, which requires computing the gradient and Hessian of the objective function to update the model parameters in each iteration. This makes the model faster and more efficient compared to traditional methods."
    },
    "14": {
        "title": "Tree Splitting and Regularization in XGBoost",
        "content": "In XGBoost, the decision tree splitting process involves maximizing the gain at each node. Gain is a measure of how much the split improves the prediction accuracy. The gain is calculated using the gradients and Hessians of the left and right child nodes of the tree. The formula for calculating the gain involves the sums of gradients (GL, GR) and Hessians (HL, HR) in the left and right child nodes, regularization parameters (λ and γ), and the penalty for adding a new leaf. Regularization is a critical component in XGBoost to prevent overfitting. XGBoost employs two types of regularization: L1 Regularization (Lasso), which promotes sparsity by penalizing tree complexity and aids in feature selection, and L2 Regularization (Ridge), which shrinks the weights to prevent large values and controls the model complexity. The objective function is adjusted with a regularization term, where T represents the number of leaves in the tree, and γ and λ control the size of the tree and weight shrinkage, respectively. These regularization terms help maintain a balance between model complexity and generalization."
    },
    "15": {
        "title": "Mathematics Behind XGBoost: Decision Trees",
        "content": "In XGBoost, each decision tree is built by minimizing an objective function. This objective function consists of two main components: a loss function, which measures how well the model’s predictions match the true labels, and a regularization term, which helps control overfitting by penalizing complex models. The decision tree learning process begins by fitting a tree to the data, with the aim of reducing the residuals from previous trees. The regularization term ensures that the model doesn't become overly complex, allowing it to generalize better to unseen data."
    },
    "16": {
        "title": "Objective Function of XGBoost",
        "content": "The objective function in XGBoost is key to its learning process. It is optimized during each boosting step and consists of a loss function and a regularization term. The loss function, denoted as l, measures how well the model's predictions align with the actual labels. Common examples include squared error for regression or log loss for classification. The regularization term, denoted Ω(ft), is used to prevent overfitting by penalizing large model complexities. In each boosting iteration, the goal is to minimize the objective function, balancing prediction accuracy and model simplicity to achieve the best performance."
    },
    "17": {
        "title": "Principal Component Analysis (PCA) - Eigenvalue Sorting, Component Selection, and Data Transformation",
        "content": "In this step of PCA, the first task is to sort the eigenvectors according to their eigenvalues. This is done using `np.argsort(-eigenvalues)` which sorts the eigenvalues in descending order and returns the indices. The eigenvectors are then reordered using these sorted indices to ensure they correspond to the largest eigenvalues. After sorting, the top k principal components are selected by choosing the first k eigenvectors corresponding to the largest eigenvalues. The value of k determines the dimensionality of the projected data, which in this case is set to 1. To project the data, the centered data matrix (X_centered) is multiplied by the selected eigenvectors `W`. This transformation reduces the data into a lower-dimensional space, which in this example is a 1D projection. After transformation, a scatter plot is created to compare the original data (shown in blue) and the projected data (shown in red). The eigenvectors are also visualized as arrows indicating the direction of maximum variance, providing insights into the directions along which the data varies the most. The resulting plot is labeled with axes for features and a title indicating that it is a PCA projection onto 1D."
    },
    "18": {
        "title": "Linear Kernel",
        "content": "The simplest kernel is the Linear Kernel, which is used when the data is already linearly separable. The Linear Kernel is simply the dot product of the data points in the original feature space. When using this kernel, we do not need to transform the data, as it is already separable with a linear hyperplane. The mathematical justification for the Linear Kernel is that the decision function in SVM becomes the dot product of the weight vector w and the input feature x, which leads to a linear decision boundary."
    },
    "19": {
        "title": "Polynomial Kernel — Handling Nonlinear Data",
        "content": "A Polynomial Kernel is used to capture nonlinear relationships in data by allowing for a higher-degree polynomial transformation without explicitly computing the transformation. The Polynomial Kernel is defined as K(x, x') = (x ⋅ x' + c)^d, where d is the degree of the polynomial and c is a constant. The degree of the polynomial controls the complexity of the kernel and how well it can capture the nonlinear relationships in the data. Expanding the kernel shows that it introduces quadratic and higher-order terms into the feature space, which allows the SVM to find a nonlinear decision boundary."
    }
}